package ru.bogdanov.data;

import ru.bogdanov.model.EGender;
import ru.bogdanov.model.Numbers;
import ru.bogdanov.model.SystemName;

import java.util.Arrays;
import java.util.HashMap;
import java.util.List;

public class DataNumbers {
    public static final List<Numbers> numbers = Arrays.asList(
        new Numbers(3, "три", "трёх", "трём", "три", "тремя", "трёх"),
        new Numbers(4, "четыре", "четырех", "четырем", "четыре", "четырьмя", "четырех"),
        new Numbers(5, "пять", "пяти", "пяти", "пять", "пятью", "пяти"),
        new Numbers(6, "шесть", "шести", "шести", "шесть", "шестью", "шести"),
        new Numbers(7, "семь", "семи", "семи", "семь", "семью", "семи"),
        new Numbers(8, "восемь", "восьми", "восьми", "восемь", "восемью", "восьми"),
        new Numbers(9, "девять", "девяти", "девяти", "девять", "девятью", "девяти"),

        new Numbers(11, "одиннадцать", "одиннадцати", "одиннадцати", "одиннадцать", "одиннадцатью", "одиннадцати"),
        new Numbers(12, "двенадцать", "двенадцати", "двенадцати", "двенадцать", "двенадцатью", "двенадцати"),
        new Numbers(13, "тринадцать", "тринадцати", "тринадцати", "тринадцать", "тринадцатью", "тринадцати"),
        new Numbers(14, "четырнадцать", "четырнадцати", "четырнадцати", "четырнадцать", "четырнадцатью", "четырнадцати"),
        new Numbers(15, "пятнадцать", "пятнадцати", "пятнадцати", "пятнадцать", "пятнадцатью", "пятнадцати"),
        new Numbers(16, "шестнадцать", "шестнадцати", "шестнадцати", "шестнадцать", "шестнадцатью", "шестнадцати"),
        new Numbers(17, "семнадцать", "семнадцати", "семнадцати", "семнадцать", "семнадцатью", "семнадцати"),
        new Numbers(18, "восемнадцать", "восемнадцати", "восемнадцати", "восемнадцать", "восемнадцатью", "восемнадцати"),
        new Numbers(19, "девятнадцать", "девятнадцати", "девятнадцати", "девятнадцать", "девятнадцатью", "девятнадцати"),

        new Numbers(10, "десять", "десяти", "десяти", "десять", "десятью", "десяти"),
        new Numbers(20, "двадцать", "двадцати", "двадцати", "двадцать", "двадцатью", "двадцати"),
        new Numbers(30, "тридцать", "тридцати", "тридцати", "тридцать", "тридцатью", "тридцати"),
        new Numbers(40, "сорок", "сорока", "сорока", "сорок", "сорока", "сорока"),
        new Numbers(50, "пятьдесят", "пятидесяти", "пятидесяти", "пятьдесят", "пятьюдесятью", "пятидесяти"),
        new Numbers(60, "шестьдесят", "шестидесяти", "шестидесяти", "шестьдесят", "шестьюдесятью", "шестидесяти"),
        new Numbers(70, "семьдесят", "семидесяти", "семидесяти", "семьдесят", "семьюдесятью", "семидесяти"),
        new Numbers(80, "восемьдесят", "восьмидесяти", "восьмидесяти", "восемьдесят", "восьмьюдесятью", "восьмидесяти"),
        new Numbers(90, "девяносто", "девяноста", "девяноста", "девяносто", "девяноста", "девяноста"),

        new Numbers(100, "сто", "ста", "ста", "сто", "ста", "ста"),
        new Numbers(200, "двести", "двухсот", "двумстам", "двести", "двумястами", "двухстах"),
        new Numbers(300, "триста", "трёхсот", "трёмстам", "триста", "тремястами", "трёхстах"),
        new Numbers(400, "четыреста", "четырёхсот", "четырёмстам", "четыреста", "четырьмястами", "четырёхстах"),
        new Numbers(500, "пятьсот", "пятисот", "пятистам", "пятьсот", "пятьюстами", "пятистах"),
        new Numbers(600, "шестьсот", "шестисот", "шестистам", "шестьсот", "шестьюстами", "шестистах"),
        new Numbers(700, "семьсот", "семисот", "семистам", "семьсот ", "семьюстами", "семистах "),
        new Numbers(800, "восемьсот", "восьмисот", "восьмистам", "восемьсот", "восемьюстами", "восьмистах"),
        new Numbers(900, "девятьсот", "девятисот", "девятистам", "девятьсот", "девятьюстами", "девятистах")
    );

    public static final List<Numbers> numbersOneAndTwo = Arrays.asList(
            new Numbers(1, EGender.МУРЖСКОЙ, "один", "одного", "одному", "один ", "одним", "одном"),
            new Numbers(1, EGender.ЖЕНСКИЙ, "одна", "одной", "одной", "одну", "одной", "одной"),
            new Numbers(1, EGender.СРЕДНИЙ, "одно", "одного", "одному", "один ", "одним", "одном"),
            new Numbers(2, EGender.МУРЖСКОЙ, "два", "двух", "двум", "два", "двумя", "двух"),
            new Numbers(2, EGender.ЖЕНСКИЙ, "две", "двух", "двум", "две", "двумя", "двух"),
            new Numbers(2, EGender.СРЕДНИЙ, "два", "двух", "двум", "два", "двумя", "двух")
    );

    public static final HashMap<String, SystemName> systemNameSystem = new HashMap<String, SystemName>() {{
        put("thousandOne", new SystemName("тысяча", "тысячи", "тысяче", "тысячу", "тысячей", "тысяче"));
        put("thousandMany_1", new SystemName("тысячи", "тысяч", "тысячам", "тысячи", "тысячами", "тысячах"));
        put("thousandMany_2", new SystemName("тысяч", "тысяч", "тысячам", "тысяч", "тысячами", "тысячах"));
        put("millionOne", new SystemName("миллион", "миллиона", "миллиону", "миллион", "миллионом", "миллионе"));
        put("millionTwo_1", new SystemName("миллиона", "миллионов", "миллионам", "миллиона", "миллионами", "миллионах"));
        put("millionTwo_2", new SystemName("миллионов", "миллионов", "миллионам", "миллионов", "миллионами", "миллионах"));
    }};
}
